package day0603;

/*
 * 需求：二维数组遍历
 * 道路千万条
 * 安全第一条
 * 行车不规范
 * 亲人两行泪
 * 
 * 按如下模式打印
 * 亲行安道
 * 人车全路
 * 两不第千
 * 行规一万
 * 泪范条条
 */
public class Test1 {
	public static void main(String[] args) {
		char[][] a = { //
				{ '道', '路', '千', '万', '条' }, //
				{ '安', '全', '第', '一', '条' }, //
				{ '行', '车', '不', '规', '范' }, //
				{ '亲', '人', '两', '行', '泪' } //
		};
		// 30,20,10,00
		// 31,21,11,01
		// 32,22,12,02
		// 33,23,13,03
		// 34,24,14,04
		for (int i = 0; i < a[0].length; i++) {// 循环遍历，行数，范围为从0到内循环任意数组长度
			for (int j = a.length - 1; j >= 0; j--) {// 循环遍历，列数，范围为从外循环长度到0
				System.out.print(a[j][i]);// 循环打印，根据要求，行号放后面
			}
			System.out.println();// 行尾换行
		}
	}
}
